Synwit-Co-Ltd/SWM220/SWM220_Lib/ADC/SimplADC_DMA/APP/main.c
#include "SWM220.h"


uint32_t ADC_Result[1000];

void SerialInit(void);

int main(void)
{
	ADC_InitStructure ADC_initStruct;
	
	SystemInit();
	
	SerialInit();
	
	PORT_Init(PORTA, PIN14, PORTA_PIN14_ADC_IN0, 0);//PA.14 => ADC.CH0
	PORT_Init(PORTA, PIN13, PORTA_PIN13_ADC_IN1, 0);//PA.13 => ADC.CH1
	PORT_Init(PORTA, PIN12, PORTA_PIN12_ADC_IN2, 0);//PA.12 => ADC.CH2
	PORT_Init(PORTA, PIN11, PORTA_PIN11_ADC_IN3, 0);//PA.11 => ADC.CH3
	PORT_Init(PORTA, PIN10, PORTA_PIN10_ADC_IN4, 0);//PA.10 => ADC.CH4
	PORT_Init(PORTA, PIN9,  PORTA_PIN9_ADC_IN5,  0);//PA.9  => ADC.CH5
	PORT_Init(PORTA, PIN8,  PORTA_PIN8_ADC_IN6,  0);//PA.8  => ADC.CH6
	PORT_Init(PORTA, PIN7,  PORTA_PIN7_ADC_IN7,  0);//PA.7  => ADC.CH7
	
	ADC_initStruct.clk_src = ADC_CLKSRC_SYSCLK_DIV4;
	ADC_initStruct.clk_div = 24;
	ADC_initStruct.channels = ADC_CH1;				//使能通道7
	ADC_initStruct.trig_src = ADC_TRIGSRC_SW;
	ADC_initStruct.samplAvg = ADC_AVG_SAMPLE1;
	ADC_initStruct.Continue = 1;					//连续模式
	ADC_initStruct.EOC_IEn = 0;						//使用DMA就不需要使用ADC中断了	
	ADC_initStruct.OVF_IEn = 0;
	ADC_Init(ADC, &ADC_initStruct);					//配置ADC
	
	DMA_CH_Config(DMA_CHR_ADC, (uint32_t)ADC_Result, 1000, 1);
	
	DMA_CH_Open(DMA_CHR_ADC);
	
	ADC_Open(ADC);									//使能ADC
	ADC_Start(ADC);									//启动ADC，开始转换
	
	while(1==1)
	{
	}
}

void DMA_Handler(void)
{
	uint32_t i, res, chn;
	
	if(DMA_CH_INTStat(DMA_CHR_ADC))
	{
		ADC_Stop(ADC);
		
		DMA_CH_INTClr(DMA_CHR_ADC);		//清除中断标志
		
		for(i = 0; i < 1000; i++)
		{
			chn = (ADC_Result[i] >> 12) & 0x07;
			res = (ADC_Result[i] & 0xFFF);
			printf("%d,", res);
		}
		
		DMA_CH_Open(DMA_CHR_ADC);		//在传输完成后通道开启会自动清零
		ADC_Start(ADC);
	}
}

void SerialInit(void)
{
	UART_InitStructure UART_initStruct;
	
	PORT_Init(PORTB, PIN11, PORTB_PIN11_UART0_RX, 1);	//GPIOB.11配置为UART0输入引脚
	PORT_Init(PORTB, PIN12, PORTB_PIN12_UART0_TX, 0);	//GPIOB.12配置为UART0输出引脚
 	
	UART_initStruct.Baudrate = 57600;
	UART_initStruct.DataBits = UART_DATABIT_8;
	UART_initStruct.Parity = UART_PARITY_NONE;
	UART_initStruct.StopBits = UART_STOPBIT_1;
	UART_initStruct.RXThresholdIEn = 0;
	UART_initStruct.TXThresholdIEn = 0;
	UART_initStruct.TimeoutIEn = 0;
 	UART_Init(UART0, &UART_initStruct);
	UART_Open(UART0);
}

/****************************************************************************************************************************************** 
* 函数名称: fputc()
* 功能说明: printf()使用此函数完成实际的串口打印动作
* 输    入: int ch		要打印的字符
*			FILE *f		文件句柄
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
int fputc(int ch, FILE *f)
{
	UART_WriteByte(UART0, ch);
	
	while(UART_IsTXBusy(UART0));
 	
	return ch;
}
